<template>
  <section class="section">
    <MainBanner />
  </section>
  <section class="section" id="turn">
    <TurnCard
      :turnInfo="turnDescription"
      title="Наши направления"
      subtitle="Мы предлагаем страховые решения для бизнеса, помогая защитить его от финансовых рисков и непредвиденных ситуаций, обеспечивая надежность и удобство оформления."
      :bodyClass="'third'"
    />
  </section>
  <section class="section">
    <Choice
      :choiceInfo="choiceDescription"
      title="Почему выбирают нас?"
      subtitle="Выбирая Code7 Страхование, вы получаете надежного партнера, который делает процесс оформления страховых полисов максимально простым и удобным."
    />
  </section>
  <section class="section">
    <Service />
  </section>
  <section class="section">
    <FAQ title="Вопросы и ответы" :faqOptions="faqDescription" />
  </section>
</template>

<script>
import MainBanner from "../components/TheBannerMain.vue";
import TurnCard from "../components/TheTurnCard.vue";
import Choice from "../components/TheChoice.vue";
import Service from "../components/TheService.vue";
import FAQ from "../components/TheFAQ.vue";
export default {
  components: {
    MainBanner,
    TurnCard,
    Choice,
    Service,
    FAQ,
  },
  data() {
    return {
      turnDescription: [
        {
          img: "/img/cards/item1.webp",
          alt: "img",
          title: "ОСГОП такси ",
          text: "Узнать больше",
          backTitle: "ОСГОП такси",
          backText:
            "Полис защищает пассажиров и бизнес владельца такси в случае ДТП или других страховых случаев.",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M24 13C24 12.2044 23.6839 11.4413 23.1213 10.8787C22.5587 10.3161 21.7957 10 21 10H20.522L15.84 3.285C15.5637 2.88839 15.1956 2.56442 14.7671 2.34069C14.3386 2.11695 13.8624 2.00007 13.379 2H6.379C5.77082 2.0025 5.1776 2.18881 4.67719 2.53449C4.17679 2.88017 3.79258 3.36906 3.575 3.937L0.975003 10.785C0.667284 11.066 0.42162 11.4082 0.253729 11.7896C0.0858387 12.171 -0.00058008 12.5833 2.93033e-06 13V18H2V18.5C2 19.4283 2.36875 20.3185 3.02513 20.9749C3.68151 21.6313 4.57175 22 5.5 22C6.42826 22 7.3185 21.6313 7.97488 20.9749C8.63126 20.3185 9 19.4283 9 18.5V18H15V18.5C15 19.4283 15.3688 20.3185 16.0251 20.9749C16.6815 21.6313 17.5717 22 18.5 22C19.4283 22 20.3185 21.6313 20.9749 20.9749C21.6313 20.3185 22 19.4283 22 18.5V18H24V13ZM14.2 4.428L18.084 10H11V4H13.379C13.5402 3.99988 13.6991 4.03874 13.842 4.11326C13.985 4.18778 14.1078 4.29576 14.2 4.428ZM5.447 4.645C5.51897 4.45549 5.64682 4.29233 5.81362 4.17714C5.98042 4.06195 6.17829 4.00018 6.381 4H9V10H3.416L5.447 4.645ZM7 18.5C7 18.8978 6.84197 19.2794 6.56066 19.5607C6.27936 19.842 5.89783 20 5.5 20C5.10218 20 4.72065 19.842 4.43934 19.5607C4.15804 19.2794 4 18.8978 4 18.5V18H7V18.5ZM20 18.5C20 18.8978 19.842 19.2794 19.5607 19.5607C19.2794 19.842 18.8978 20 18.5 20C18.1022 20 17.7207 19.842 17.4393 19.5607C17.158 19.2794 17 18.8978 17 18.5V18H20V18.5ZM22 16H2V13C2 12.7348 2.10536 12.4804 2.2929 12.2929C2.48043 12.1054 2.73479 12 3 12H21C21.2652 12 21.5196 12.1054 21.7071 12.2929C21.8946 12.4804 22 12.7348 22 13V16Z" fill="currentColor"/></svg>',
          url: "/osgop",
        },
        {
          img: "/img/cards/item2.webp",
          alt: "img",
          title: "Страхование имущества",
          text: "Узнать больше",
          backTitle: "Страхование имущества",
          backText:
            "Защита недвижимости, оборудования и других активов бизнеса от пожаров, затоплений, краж и других непредвиденных ситуаций",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_3257_5027)"><path d="M14.849 12.747L9.401 8.482C8.577 7.837 7.424 7.836 6.6 8.482L1.151 12.746C0.42 13.319 0 14.181 0 15.109V24H16V15.109C16 14.18 15.58 13.319 14.849 12.747ZM14 22H2V15.109C2 14.799 2.14 14.512 2.384 14.321L7.832 10.058C7.93 9.98 8.068 9.981 8.168 10.058L13.616 14.323C13.86 14.513 14 14.801 14 15.11V22ZM6 15H10V19H6V15ZM18 13H20V15H18V13ZM18 17H20V19H18V17ZM14 5H16V7H14V5ZM20 7H18V5H20V7ZM14 9H16V11H14V9ZM18 9H20V11H18V9ZM24 3V24H18V22H22V3C22 2.448 21.552 2 21 2H13C12.448 2 12 2.448 12 3V7.978L10 6.413V3C10 2.983 10 2.965 10.001 2.948C10.029 1.318 11.363 0 13 0H21C22.654 0 24 1.346 24 3Z" fill="currentColor"/></g><defs><clipPath id="clip0_3257_5027"><rect width="24" height="24" fill="white"/></clipPath></defs></svg>',
          url: "/insurance",
        },
        {
          img: "/img/cards/item3.webp",
          alt: "img",
          title: "Страхование ЧОП",
          text: "Узнать больше",
          backTitle: "Страхование ЧОП",
          backText:
            "Обеспечивает страхование ответственности частных охранных предприятий (ЧОП) за имущественный вред, причинённый третьим лицам при оказании охранных услуг.",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="currentColor" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_3257_5032)"><path d="M14.849 12.747L9.401 8.482C8.577 7.837 7.424 7.836 6.6 8.482L1.151 12.746C0.42 13.319 0 14.181 0 15.109V24H16V15.109C16 14.18 15.58 13.319 14.849 12.747ZM14 22H2V15.109C2 14.799 2.14 14.512 2.384 14.321L7.832 10.058C7.93 9.98 8.068 9.981 8.168 10.058L13.616 14.323C13.86 14.513 14 14.801 14 15.11V22ZM6 15H10V19H6V15ZM18 13H20V15H18V13ZM18 17H20V19H18V17ZM14 5H16V7H14V5ZM20 7H18V5H20V7ZM14 9H16V11H14V9ZM18 9H20V11H18V9ZM24 3V24H18V22H22V3C22 2.448 21.552 2 21 2H13C12.448 2 12 2.448 12 3V7.978L10 6.413V3C10 2.983 10 2.965 10.001 2.948C10.029 1.318 11.363 0 13 0H21C22.654 0 24 1.346 24 3Z" fill="currentColor"/></g><defs><clipPath id="clip0_3257_5032"><rect width="24" height="24" fill="currentColor"/></clipPath></defs></svg>',
          url: "/insurance-cop",
        },
      ],
      choiceDescription: [
        {
          name: "Удобство",
          text: "Оформление полисов онлайн без необходимости личного присутствия.",
        },
        {
          name: "Надежность",
          text: "Работаем с проверенной страховой компанией Zetta c 20 летним опытом на рынке.",
        },
        {
          name: "Скорость",
          text: "Минимальные требования к документам и быстрое оформление онлайн.",
        },
        {
          name: "Поддержка",
          text: "Наша команда всегда на связи, чтобы помочь с любыми вопросами.",
        },
      ],
      faqDescription: [
        {
          name: "Являетесь ли вы страховой компанией?",
          text: "Нет, мы выступаем агентами и сотрудничаем со страховыми компаниями для удобного оформления полисов.",
        },
        {
          name: "Как быстро я получу полис?",
          text: "Полис приходит на указанный email в течение 2-4 часов после оплаты.",
        },
        {
          name: "Что делать при страховом случае?",
          text: "Свяжитесь со страховой компанией, указанной в полисе. Мы готовы проконсультировать и помочь с оформлением обращения.",
        },
      ],
    };
  },
};
</script>

<style lang="scss"></style>
