<template>
  <section class="section"><Banner :descr="bannerDescription" /></section>
  <section class="section">
    <Choice
      :choiceInfo="choiceDescription"
      title="Почему полис от Code7?"
      subtitle="Выбирая Code7 Страхование, вы получаете надежного партнера, который делает процесс оформления страховых полисов максимально простым и удобным."
    />
  </section>
  <section class="section">
    <DqscriptionQ :descriptionQuestion="descriptionQuestion" />
  </section>
  <section class="section" id="turn">
    <TurnCard
      :turnInfo="turnDescription"
      title="Виды страхования"
      subtitle="В программу защиты включены самые распространенные и наиболее существенные риски."
      :bodyClass="'fourth'"
    />
  </section>
  <section class="section">
    <Order :orderInfo="orderDescription" title="Как оформить?" />
  </section>

  <section class="section" id="policy">
    <Quiz />
  </section>
</template>

<script>
import Banner from "../components/TheBanner.vue";
import Choice from "../components/TheChoice.vue";
import TurnCard from "../components/TheTurnCard.vue";
import Order from "../components/TheOrder.vue";
import DqscriptionQ from "../components/TheQuestion.vue";
import Quiz from "../components/TheQuizInsurance.vue";
export default {
  components: {
    Banner,
    Choice,
    TurnCard,
    Order,
    DqscriptionQ,
    Quiz,
  },
  data() {
    return {
      bannerDescription: {
        img: "/img/bgBanner/item2.webp",
        alt: "picture",
        title:
          "<span class='color-primary'>Страхование имущества</span> — защита бизнеса от рисков",
        subtitle:
          "Рассчитайте стоимость страхования имущества и оформите заявку на полис за пару минут.",
        url: "#anhkor",
        list: [
          {
            title: "до 10 дней",
            text: "Минимальные сроки выплат",
          },
          {
            title: "от 1000 ₽",
            text: "Низкая стоимость страхового полиса",
          },
          {
            title: "до 30 млн ₽",
            text: "Максимальные выплаты",
          },
        ],
      },
      choiceDescription: [
        {
          name: "Простота оформления",
          text: "Полностью онлайн — от заполнения заявки до получения полиса на email.",
        },
        {
          name: "Без лишних оценок",
          text: "Не требуется оценка имущества при подписании договора.",
        },
        {
          name: "Оперативные выплаты",
          text: "В течение 10 дней после подписания акта о происшествии.",
        },
        {
          name: "Надёжная поддержка",
          text: "Наша команда всегда на связи, чтобы помочь с любыми вопросами.",
        },
      ],
      turnDescription: [
        {
          img: "/img/cards/item4.webp",
          alt: "img",
          title: "Недвижимое имущество ",
          text: "Подробнее",
          backTitle: "Недвижимое имущество",
          backText:
            "Позволяет получить компенсацию за урон, причиненный производственным помещениям, административным зданиям и другим видам построек.",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_3028_2261)"><path d="M14.849 12.747L9.401 8.482C8.577 7.837 7.424 7.836 6.6 8.482L1.151 12.746C0.42 13.319 0 14.181 0 15.109V24H16V15.109C16 14.18 15.58 13.319 14.849 12.747ZM14 22H2V15.109C2 14.799 2.14 14.512 2.384 14.321L7.832 10.058C7.93 9.98 8.068 9.981 8.168 10.058L13.616 14.323C13.86 14.513 14 14.801 14 15.11V22ZM6 15H10V19H6V15ZM18 13H20V15H18V13ZM18 17H20V19H18V17ZM14 5H16V7H14V5ZM20 7H18V5H20V7ZM14 9H16V11H14V9ZM18 9H20V11H18V9ZM24 3V24H18V22H22V3C22 2.448 21.552 2 21 2H13C12.448 2 12 2.448 12 3V7.978L10 6.413V3C10 2.983 10 2.965 10.001 2.948C10.029 1.318 11.363 0 13 0H21C22.654 0 24 1.346 24 3Z" fill="#7D51FE"/></g><defs><clipPath id="clip0_3028_2261"><rect width="24" height="24" fill="white"/></clipPath></defs></svg>',
        },
        {
          img: "/img/cards/item5.webp",
          alt: "img",
          title: "Сельхоз производство",
          text: "Подробнее",
          backTitle: "Сельхоз производство",
          backText:
            "Для данной отрасли такой вид защиты является очень актуальным, ведь ярко выраженная сезонность бизнеса не позволяет в течение всего года иметь крупные финансовые запасы для возмещения непредвиденных расходов",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_3028_2266)"><path d="M20.84 8.356C21.0855 8.23383 21.3105 8.07426 21.507 7.883C22.736 6.654 23.486 2.66 23.687 1.465L23.919 0.0820007L22.535 0.313001C21.335 0.513001 17.346 1.264 16.116 2.493C15.9249 2.68965 15.7653 2.91463 15.643 3.16C15.116 2.303 14.573 1.56 14.299 1.194L13.5 0.131001L12.7 1.194C11.7453 2.42824 10.9398 3.77087 10.3 5.194L9.49997 4.131L8.69997 5.194C7.74534 6.42824 6.93977 7.77087 6.29997 9.194L5.49997 8.131L4.69997 9.194C4.06697 10.036 1.99997 12.909 1.99997 14.5C1.99997 15.736 3.08097 17.748 3.73497 18.851L0.0429688 22.543L1.45697 23.957L5.14897 20.265C6.25197 20.919 8.26497 22 9.49997 22C11.091 22 13.964 19.933 14.806 19.3L15.869 18.5L14.806 17.7C16.2292 17.0604 17.5719 16.2548 18.806 15.3L19.869 14.5L18.806 13.7C20.2292 13.0604 21.5719 12.2548 22.806 11.3L23.869 10.5L22.806 9.7C22.441 9.427 21.7 8.884 20.84 8.356ZM17.53 3.907C18.7413 3.22855 20.0646 2.77331 21.437 2.563C21.2273 3.93518 20.772 5.25833 20.093 6.469C19.137 6.92115 18.0737 7.09744 17.023 6.978C16.9073 5.92721 17.0826 4.86484 17.53 3.907ZM13.5 3.53C14.1785 4.41927 14.687 5.42614 15 6.5C14.9723 7.09657 14.7734 7.67254 14.427 8.159L13.2 9.387C12.6346 8.50205 12.2285 7.52497 12 6.5C12.313 5.42614 12.8215 4.41927 13.5 3.53ZM9.49997 7.53C10.1785 8.41927 10.687 9.42614 11 10.5C10.9721 11.0964 10.7736 11.6722 10.428 12.159L9.19997 13.387C8.6346 12.502 8.22848 11.525 7.99997 10.5C8.31296 9.42614 8.82148 8.41927 9.49997 7.53ZM3.99997 14.5C4.31296 13.4261 4.82148 12.4193 5.49997 11.53C6.17846 12.4193 6.68698 13.4261 6.99997 14.5C6.97288 15.0962 6.77426 15.6719 6.42797 16.158L5.19997 17.387C4.6346 16.502 4.22848 15.525 3.99997 14.5ZM9.49997 20C8.47524 19.7717 7.49846 19.3656 6.61397 18.8L7.84197 17.573C8.32794 17.2264 8.90366 17.0274 9.49997 17C10.5741 17.3131 11.5813 17.8216 12.471 18.5C11.5813 19.1784 10.5741 19.6869 9.49997 20ZM13.5 16C12.4752 15.7717 11.4985 15.3656 10.614 14.8L11.842 13.572C12.3283 13.2261 12.9038 13.0275 13.5 13C14.5741 13.3131 15.5813 13.8216 16.471 14.5C15.5813 15.1784 14.5741 15.6869 13.5 16ZM17.5 12C16.4754 11.7712 15.4987 11.3651 14.614 10.8L15.842 9.571C16.3284 9.22547 16.904 9.02725 17.5 9C18.5741 9.31311 19.5813 9.82161 20.471 10.5C19.5813 11.1784 18.5741 11.6869 17.5 12Z" fill="#7D51FE"/></g><defs><clipPath id="clip0_3028_2266"><rect width="24" height="24" fill="white"/></clipPath></defs></svg>',
        },
        {
          img: "/img/cards/item6.webp",
          alt: "img",
          title: "Перерывы в производстве",
          text: "Подробнее",
          backTitle: "Перерывы в производстве",
          backText:
            "Позволит компенсировать финансовые издержки, связанные с приостановкой компанией своей деятельности.",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_3028_2271)"><path d="M12 0C5.383 0 0 5.383 0 12C0 18.617 5.383 24 12 24C18.617 24 24 18.617 24 12C24 5.383 18.617 0 12 0ZM12 22C6.486 22 2 17.514 2 12C2 6.486 6.486 2 12 2C17.514 2 22 6.486 22 12C22 17.514 17.514 22 12 22ZM9 8H11V16H9V8ZM13 8H15V16H13V8Z" fill="#7D51FE"/></g><defs><clipPath id="clip0_3028_2271"><rect width="24" height="24" fill="white"/></clipPath></defs></svg>',
        },
        {
          img: "/img/cards/item7.webp",
          alt: "img",
          title: "Коммерческие преступления",
          text: "Подробнее",
          backTitle: "Коммерческие преступления",
          backText:
            "Защитит бизнес от потерь, наступивших вследствие злого умысла третьих лиц или сотрудников предприятия.",
          ico: '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M14.541 5.472C15.737 4.452 17 2.924 17 1V0H7V1C7 2.924 8.263 4.451 9.459 5.472C4.754 7.149 1 13.124 1 18C1 21.309 3.691 24 7 24H17C20.309 24 23 21.309 23 18C23 13.124 19.246 7.149 14.541 5.472ZM9.207 2H14.79C14.269 3.256 12.9 4.31 12.007 4.852C11.255 4.392 9.756 3.34 9.208 2H9.207ZM17 22H7C4.794 22 3 20.206 3 18C3 12.839 7.59 7.017 11.998 7.017C16.406 7.017 21 12.84 21 18C21 20.206 19.206 22 17 22Z" fill="#7D51FE"/><path d="M8 16.6618V15.1636H12.9309C13.0085 15.1636 13.103 15.1612 13.2145 15.1564C13.3309 15.1467 13.4594 15.1224 13.6 15.0836C14.0024 14.9721 14.2933 14.7709 14.4727 14.48C14.6521 14.1842 14.7418 13.84 14.7418 13.4473C14.7418 13.2097 14.7055 12.9721 14.6327 12.7345C14.5648 12.4921 14.4461 12.2788 14.2764 12.0945C14.1115 11.9103 13.8861 11.7818 13.6 11.7091C13.4739 11.6752 13.3455 11.6558 13.2145 11.6509C13.0885 11.6461 12.9939 11.6436 12.9309 11.6436H10.1891V10H13.0036C13.057 10 13.1612 10.0024 13.3164 10.0073C13.4764 10.0121 13.6533 10.0291 13.8473 10.0582C14.4485 10.1503 14.9455 10.3515 15.3382 10.6618C15.7358 10.9721 16.0291 11.3648 16.2182 11.84C16.4121 12.3103 16.5091 12.8291 16.5091 13.3964C16.5091 14.2642 16.2885 14.9818 15.8473 15.5491C15.4061 16.1164 14.7394 16.4679 13.8473 16.6036C13.6533 16.6279 13.4764 16.6448 13.3164 16.6545C13.1612 16.6594 13.057 16.6618 13.0036 16.6618H8ZM8 19.0473V17.6727H14.2036V19.0473H8ZM9.04 20.4727V10H10.7927V20.4727H9.04Z" fill="#7D51FE"/></svg>',
        },
      ],
      orderDescription: [
        {
          name: "Расчет стоимости",
          text: "Выберите пакет и укажите страховую суммув калькуляторе, чтобы узнать примерную стоимость Вашего полиса.",
        },
        {
          name: "Оформление заявки",
          text: "Укажите Ваши данные и отправьте заявку на оформление. Дождитесь звонка нашего менеджера, мы уточним детали и подскажем точную стоимость страхования.",
        },
        {
          name: "Договор и оплата",
          text: "После оформления необходимо подписать договор и оплатить полис страхования по отправленной менеджером ссылке, выбрав удобный вариант оплаты.",
        },
        {
          name: "Получение полиса",
          text: "После подписания и оплаты полис будет отправлен на указанный Вами Email в течение 2-4 часов.",
        },
      ],
      descriptionQuestion: {
        title: "Что такое полис страхования имущества?",
        text: "<p>Страхование имущества защищает бизнес от финансовых потерь, вызванных повреждением или уничтожением активов.</p>",
        warning:
          "Полис покрывает ущерб, связанный с авариями, пожарами, кражами и другими рисками.",
        anhor: "#policy",
      },
    };
  },
};
</script>

<style lang="scss" scoped></style>
